-- MySQL dump 10.16  Distrib 10.1.34-MariaDB, for Linux (x86_64)
--
-- Host: localhost    Database: library
-- ------------------------------------------------------
-- Server version	10.1.34-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `Category`
--

DROP TABLE IF EXISTS `Category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `Category` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `category` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '未命名分类',
  `type` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Category`
--

LOCK TABLES `Category` WRITE;
/*!40000 ALTER TABLE `Category` DISABLE KEYS */;
INSERT INTO `Category` VALUES (1,'网络文学','男频','2018-07-03 03:39:46','2018-07-03 03:39:46'),(2,'网络文学','女频','2018-07-03 03:39:51','2018-07-03 03:39:51'),(3,'网络文学','玄幻奇幻','2018-07-03 03:40:11','2018-07-03 03:40:11'),(4,'网络文学','现代都市','2018-07-03 03:40:16','2018-07-03 03:40:16'),(5,'网络文学','武侠仙侠','2018-07-03 03:40:22','2018-07-03 03:40:22'),(6,'网络文学','现代言情','2018-07-03 03:40:28','2018-07-03 03:40:28'),(7,'网络文学','穿越重生','2018-07-03 03:40:35','2018-07-03 03:40:35'),(8,'网络文学','古装言情','2018-07-03 03:40:40','2018-07-03 03:40:40'),(9,'教育','中小学教辅','2018-07-03 03:41:51','2018-07-03 03:41:51'),(10,'教育','考试','2018-07-03 03:41:57','2018-07-03 03:41:57'),(11,'教育','外语工具书','2018-07-03 03:42:01','2018-07-03 03:42:01'),(12,'教育','教师用书','2018-07-03 03:42:05','2018-07-03 03:42:05'),(13,'教育','英语四六级','2018-07-03 03:42:10','2018-07-03 03:42:10'),(14,'教育','考研','2018-07-03 03:42:16','2018-07-03 03:42:16'),(15,'教育','公务员','2018-07-03 03:42:21','2018-07-03 03:42:21'),(16,'人文社科','哲学宗教','2018-07-03 03:44:06','2018-07-03 03:44:06'),(17,'人文社科','历史','2018-07-03 03:44:25','2018-07-03 03:44:25'),(18,'人文社科','政治军事','2018-07-03 03:44:34','2018-07-03 03:44:34'),(19,'人文社科','文化','2018-07-03 03:44:39','2018-07-03 03:44:39'),(20,'人文社科','社会科学','2018-07-03 03:44:46','2018-07-03 03:44:46'),(21,'人文社科','心理学','2018-07-03 03:44:51','2018-07-03 03:44:51'),(22,'人文社科','古籍','2018-07-03 03:44:55','2018-07-03 03:44:55'),(23,'人文社科','法律','2018-07-03 03:45:00','2018-07-03 03:45:00'),(24,'科技','科普读物','2018-07-03 03:49:02','2018-07-03 03:49:02'),(25,'科技','计算机/网络','2018-07-03 03:49:09','2018-07-03 03:49:09'),(26,'科技','医学','2018-07-03 03:49:16','2018-07-03 03:49:16'),(27,'科技','工业技术','2018-07-03 03:49:21','2018-07-03 03:49:21'),(28,'科技','建筑','2018-07-03 03:49:26','2018-07-03 03:49:26'),(29,'科技','自然科学','2018-07-03 03:49:34','2018-07-03 03:49:34'),(30,'科技','农业/林业','2018-07-03 03:49:40','2018-07-03 03:49:40'),(31,'经管','经济','2018-07-03 03:52:26','2018-07-03 03:52:26'),(32,'经管','管理','2018-07-03 03:52:31','2018-07-03 03:52:31'),(33,'经管','投资理财','2018-07-03 03:52:35','2018-07-03 03:52:35'),(34,'经管','股票','2018-07-03 03:52:40','2018-07-03 03:52:40'),(35,'经管','金融','2018-07-03 03:52:45','2018-07-03 03:52:45'),(36,'经管','市场/销售','2018-07-03 03:52:51','2018-07-03 03:52:51'),(37,'经管','会计','2018-07-03 03:52:57','2018-07-03 03:52:57'),(38,'经管','互联网','2018-07-03 03:53:02','2018-07-03 03:53:02'),(39,'励志','励志/成功','2018-07-05 00:36:05','2018-07-05 00:36:05'),(40,'励志','心灵修养','2018-07-05 00:55:50','2018-07-05 00:55:50'),(41,'励志','职场','2018-07-05 00:55:58','2018-07-05 00:55:58'),(42,'励志','人生哲学','2018-07-05 00:56:03','2018-07-05 00:56:03'),(43,'励志','人际交往','2018-07-05 00:56:08','2018-07-05 00:56:08'),(44,'励志','口才/演讲/辩论','2018-07-05 00:56:14','2018-07-05 00:56:14');
/*!40000 ALTER TABLE `Category` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-07-05  8:56:53
